# ---------------------Задача 1-------------------------
# x = int(input('Введите первое число: '))
# y = int(input('Введите второе число: '))
# num_sum = 0
# num_count = 0
# for i in range(x, y+1):
#     num_sum += i
#     num_count += 1
#
# print('Сума: ', num_sum)
# print('Среднее арифметическое: ', num_sum / num_count)

# ---------------------Задача 2-------------------------
# x = int(input('Введите число: '))
# fact = 1
# for i in range(1, x+1):
#     fact *= i
#
# print('Факториал числа ', x, ' равен ', fact)

# ---------------------Задача 3-------------------------
# x = int(input('Введите число: '))
# for i in range(x):
#     print('*', end='')

# ---------------------Задача 4-------------------------
x = int(input('Введите число: '))
y = input('Введите символ: ')
for i in range(x):
    print(y, end='')